macwed/rfmesh-workspace/firmware/sdkconfig.defaults
# --- IDF target -----------------------------------------------------------
# ESP32-S2 has native USB-OTG (D+/D- on GPIO19/GPIO20), no USB-Serial-JTAG
# peripheral. Console + the protocol-mode RX/TX path both go through
# TinyUSB CDC; main.c does the stdio routing via esp_tusb_init_console().
CONFIG_IDF_TARGET="esp32s2"

# --- Console / USB-OTG TinyUSB CDC ----------------------------------------
# Disable the standard UART/JTAG console wiring; TinyUSB CDC owns stdio.
CONFIG_ESP_CONSOLE_NONE=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# TinyUSB stack (managed component espressif/esp_tinyusb, pinned in
# main/idf_component.yml). CDC interface 0 carries everything.
CONFIG_USB_OTG_SUPPORTED=y
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_CDC_COUNT=1
# Match the JTAG-driver buffer sizes the C3 salvage used (USB_RX_BUF_BYTES /
# USB_TX_BUF_BYTES in main.c). The host-side driver assumes at least these.
CONFIG_TINYUSB_CDC_RX_BUFSIZE=1024
CONFIG_TINYUSB_CDC_TX_BUFSIZE=1024

# --- Radios off (saves flash, removes coexistence headaches) --------------
# Identical to the C3 salvage. The S2 has no Bluetooth radio anyway, but the
# Wi-Fi disable keeps the binary small and removes the coexistence layer
# from the build entirely.
CONFIG_BT_ENABLED=n
CONFIG_ESP_WIFI_ENABLED=n
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=n

# --- Scheduler / NVS ------------------------------------------------------
CONFIG_FREERTOS_HZ=1000
CONFIG_NVS_ENCRYPTION=n

# --- Compiler -------------------------------------------------------------
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_WARN_WRITE_STRINGS=y
